"use strict";

module.exports = {
  up: async (queryInterface, Sequelize) => {
    return queryInterface.bulkInsert("Works", [
      {
        id: 1,
        title: "這是第一篇 demo",
        authorId: 3,
        eventId: 1,
        category: "novel",
        open: 0,
        anonymous: 0,
        content: JSON.stringify({
          ops: [
            {
              insert:
                "我們需要淘汰舊有的觀念，想必大家都能了解中立理性的重要性。",
              attributes: {
                color: "rgba(0, 0, 0, 0.87)",
              },
            },
            {
              insert: "世界上若沒有中立理性，對於人類的改變可想而知。",
              attributes: {
                bold: true,
                color: "rgba(0, 0, 0, 0.87)",
              },
            },
            {
              insert: "\n\n",
            },
            {
              insert:
                "中立理性的存在，令我無法停止對他的思考。德萊頓說過一句很有意思的話，要么做一個十足的奴隸，要么享有充分的自由。",
              attributes: {
                color: "rgba(0, 0, 0, 0.87)",
              },
            },
            {
              insert: "\n\n",
            },
            {
              insert:
                "這段話讓我所有的疑惑頓時豁然開朗。把中立理性輕鬆帶過，顯然並不適合。查普曼曾經說過，誰都沒有真正的愛情，而只有一見鍾情。但願諸位理解後能從中有所成長。約翰遜曾說過，心地善良的人，富於幻想的人比冷酷殘忍的人更容易聚合。這段話看似複雜，其中的邏輯思路卻清晰可見。我們都有個共識，若問題很困難，那就勢必不好解決。中立理性因何而發生？所謂中立理性，關鍵是中立理性需要如何解讀。約翰曾說過一句意義深遠的話，如果沒有烏雲，我們就感受不到太陽的溫暖。",
              attributes: {
                color: "rgba(0, 0, 0, 0.87)",
              },
            },
            {
              insert: "\n\n",
            },
            {
              insert:
                "這不禁令我重新仔細的思考。我們普遍認為，若能理解透徹核心原理，對其就有了一定的了解程度。既然如此，其實，若思緒夠清晰，那麼中立理性也就不那麼複雜了。需要考慮周詳中立理性的影響及因應對策。甘必大曾經說過，不善思索的有才能的人，必定以悲劇收場。這句話改變了我的人生。可是，即使是這樣，中立理性的出現仍然代表了一定的意義。我想，把中立理性的意義想清楚，對各位來說並不是一件壞事。對於一般人來說，中立理性究竟象徵著什麼呢？阿拉伯說過一句很有意思的話，家有一個敵人，比門外有一千個敵人還壞。希望大家能發現話中之話。",
              attributes: {
                color: "rgba(0, 0, 0, 0.87)",
              },
            },
            {
              insert: "\n",
            },
          ],
        }),
        version: 1,
        isDeleted: 0,
        createdAt: new Date(),
        updatedAt: new Date(),
      },
      {
        id: 2,
        title: "晚餐要吃什麼",
        authorId: 3,
        eventId: 2,
        category: "other",
        open: 0,
        anonymous: 1,
        content: JSON.stringify({
          ops: [
            {
              insert:
                "我們需要淘汰舊有的觀念，想必大家都能了解中立理性的重要性。",
              attributes: {
                color: "rgba(0, 0, 0, 0.87)",
              },
            },
            {
              insert: "世界上若沒有中立理性，對於人類的改變可想而知。",
              attributes: {
                bold: true,
                color: "rgba(0, 0, 0, 0.87)",
              },
            },
            {
              insert: "\n\n",
            },
            {
              insert:
                "中立理性的存在，令我無法停止對他的思考。德萊頓說過一句很有意思的話，要么做一個十足的奴隸，要么享有充分的自由。",
              attributes: {
                color: "rgba(0, 0, 0, 0.87)",
              },
            },
            {
              insert: "\n\n",
            },
            {
              insert:
                "這段話讓我所有的疑惑頓時豁然開朗。把中立理性輕鬆帶過，顯然並不適合。查普曼曾經說過，誰都沒有真正的愛情，而只有一見鍾情。但願諸位理解後能從中有所成長。約翰遜曾說過，心地善良的人，富於幻想的人比冷酷殘忍的人更容易聚合。這段話看似複雜，其中的邏輯思路卻清晰可見。我們都有個共識，若問題很困難，那就勢必不好解決。中立理性因何而發生？所謂中立理性，關鍵是中立理性需要如何解讀。約翰曾說過一句意義深遠的話，如果沒有烏雲，我們就感受不到太陽的溫暖。",
              attributes: {
                color: "rgba(0, 0, 0, 0.87)",
              },
            },
            {
              insert: "\n\n",
            },
            {
              insert:
                "這不禁令我重新仔細的思考。我們普遍認為，若能理解透徹核心原理，對其就有了一定的了解程度。既然如此，其實，若思緒夠清晰，那麼中立理性也就不那麼複雜了。需要考慮周詳中立理性的影響及因應對策。甘必大曾經說過，不善思索的有才能的人，必定以悲劇收場。這句話改變了我的人生。可是，即使是這樣，中立理性的出現仍然代表了一定的意義。我想，把中立理性的意義想清楚，對各位來說並不是一件壞事。對於一般人來說，中立理性究竟象徵著什麼呢？阿拉伯說過一句很有意思的話，家有一個敵人，比門外有一千個敵人還壞。希望大家能發現話中之話。",
              attributes: {
                color: "rgba(0, 0, 0, 0.87)",
              },
            },
            {
              insert: "\n",
            },
          ],
        }),
        version: 1,
        isDeleted: 0,
        createdAt: new Date(),
        updatedAt: new Date(),
      },
      {
        id: 3,
        title: "這是第一篇 demo",
        authorId: 3,
        eventId: 1,
        category: "novel",
        open: 1,
        anonymous: 0,
        content: JSON.stringify({
          ops: [
            {
              insert:
                "我們需要淘汰舊有的觀念，想必大家都能了解中立理性的重要性。",
              attributes: {
                color: "rgba(0, 0, 0, 0.87)",
              },
            },
            {
              insert: "世界上若沒有中立理性，對於人類的改變可想而知。",
              attributes: {
                bold: true,
                color: "rgba(0, 0, 0, 0.87)",
              },
            },
            {
              insert: "\n\n",
            },
            {
              insert:
                "中立理性的存在，令我無法停止對他的思考。德萊頓說過一句很有意思的話，要么做一個十足的奴隸，要么享有充分的自由。",
              attributes: {
                color: "rgba(0, 0, 0, 0.87)",
              },
            },
            {
              insert: "\n\n",
            },
            {
              insert:
                "這段話讓我所有的疑惑頓時豁然開朗。把中立理性輕鬆帶過，顯然並不適合。查普曼曾經說過，誰都沒有真正的愛情，而只有一見鍾情。但願諸位理解後能從中有所成長。約翰遜曾說過，心地善良的人，富於幻想的人比冷酷殘忍的人更容易聚合。這段話看似複雜，其中的邏輯思路卻清晰可見。我們都有個共識，若問題很困難，那就勢必不好解決。中立理性因何而發生？所謂中立理性，關鍵是中立理性需要如何解讀。約翰曾說過一句意義深遠的話，如果沒有烏雲，我們就感受不到太陽的溫暖。",
              attributes: {
                color: "rgba(0, 0, 0, 0.87)",
              },
            },
            {
              insert: "\n\n",
            },
            {
              insert:
                "這不禁令我重新仔細的思考。我們普遍認為，若能理解透徹核心原理，對其就有了一定的了解程度。既然如此，其實，若思緒夠清晰，那麼中立理性也就不那麼複雜了。需要考慮周詳中立理性的影響及因應對策。甘必大曾經說過，不善思索的有才能的人，必定以悲劇收場。這句話改變了我的人生。可是，即使是這樣，中立理性的出現仍然代表了一定的意義。我想，把中立理性的意義想清楚，對各位來說並不是一件壞事。對於一般人來說，中立理性究竟象徵著什麼呢？阿拉伯說過一句很有意思的話，家有一個敵人，比門外有一千個敵人還壞。希望大家能發現話中之話。",
              attributes: {
                color: "rgba(0, 0, 0, 0.87)",
              },
            },
            {
              insert: "\n",
            },
          ],
        }),
        version: 1,
        isDeleted: 0,
        createdAt: new Date(),
        updatedAt: new Date(),
      },
    ]);
  },

  down: async (queryInterface, Sequelize) => {
    await queryInterface.bulkDelete("Works", null, {});
  },
};
